{"posts":[{"title":"Cheung Chau","text":"Cheung Chau Personal Photography Collection Fisherman Birds and fish Road White House Oil painting Tree shade Tyndall Toys RELEAX Sacred Island Clock ringing Refuge Waves Tofu Tricolour Memories Hot Dinner","link":"/2023/01/04/Cheung-Chau/"},{"title":"Volunteer in 6th Confucius Institute Day","text":"The Confucius Institute Day was a significant event, being the first Confucius Institute Day to be resumed after the disruption caused by the COVID19. My DutyAt the Confucius Institute Day I worked on the following tasks: assisting guests with photo taking, assisting with the event attendance records and handing out gifts, managing and scheduling the props for the live performance and counting the list of props after the event. It was a very rewarding day for me, not only did my efforts ensure the event ran smoothly, but more meaningfully I gained friends and smiles.","link":"/2023/01/05/Kongzi/"},{"title":"Assisted in organising TALE 2022 during as a student assistant in the Department of Computing","text":"Transforming Educational Technologies and Pedagogies for the Next Decade About TALEIEEE International Conference on Teaching, Assessment, and Learning for Engineering (TALE) 2022. IEEE TALE is the IEEE Education Society’s flagship Asia-Pacific conference series, catering to researchers and practitioners with an interest in engineering, technology, and integrated STEM education as well as those interested in the innovative use of digital technologies for learning, teaching, and assessment in any discipline. The conference target audience is diverse and includes those working in the higher education, vocational education and training (VET), K-12, corporate, government, and healthcare sectors. ThemeTransforming Educational Technologies and Pedagogies for the Next Decade Core Tracks● Engineering Education ● Computing &amp; IT Education ● STEM Education ● Technology-Enhanced Learning ● Open, Flexible &amp; Distance Learning ● Workplace &amp; Industry-Based Learning AcknowledgementIEEE TALE 2022 is supported by a grant of the Croucher Foundation","link":"/2023/01/05/TALE/"},{"title":"Tai Mo Shan","text":"Tai Mo Shan Personal Photography Collection Road Human Ink Miao Gao Wind City Orange afternoon World Cup M148 Downhill Winter Tiredness Home","link":"/2023/01/04/Tai-Mo-Shan/"},{"title":"Volunteers for the PolyU 85th Anniversary Public Lecture Series","text":"To celebrate its 85th anniversary, PolyU organised a public lecture at the Jockey Club Auditorium PolyU inviting Ms Guo Jingjing, an Olympic gold medalist, to share her experience as an athlete and Olympic gold medalist with the theme of “Pouring Water into Light - Chasing Your Dreams” to encourage young people to persevere in pursuing their dreams. The talk attracted over 800 guests, students, teachers, alumni and members of the public. My dutyI am honoured to have been given the opportunity by the PolyU to participate in this event and my area of responsibility is the auditorium.","link":"/2023/01/05/guojingjing/"},{"title":"PolyU Undergraduate Info Day 2022 COMP student helper","text":"It Is estimated that more than 6,000 visitors to PolyU campus in this year Info Day. My task was to give them information about our programees and our school My DutyI need to be passionate about introducing visitors to our profession and trying to bring them back to our stand for further conversation. This is a great way to develop my communication skills. In addition to this, it was also my task to take visitors to our department’s laboratories and to answer their questions and give them detailed information about our department on the way.","link":"/2023/01/05/infoDay/"},{"title":"Volunteer Umpire in 2022 Poly CSSA Table Tennis Competition","text":"The event is organised by PolyU CSSA and the venue and prize costs are also covered by CSSA. My dutyMy task is to supervise the game, calculate the scores for the game and announce the winner.","link":"/2023/01/05/pingpang/"},{"title":"Multi-thread Web Server","text":"This project aims to develop a socket program to implement a Web service using the HTTP protocol. Downald from GIT: https://github.com/FoeverA0/Multi-thread-Web-Server.git Function create a connection socket when contacted by a client (browser); receive the HTTP request from this connection; parse the request to determine the specific file being requested; get the requested file from the server’s file system; create an HTTP response message consisting of the requested file preceded by header lines; send the response over the TCP connection to the requesting client. If the client requests a file that is not present in the server, the server will return a “404 Not Found” error message. NoteYour can run server program, and then test server program by sending requests from the client programs running on different hosts. You may run the server on your own computer, using the IP address of 127.0.0.1. If you run server on a host that already has a Web server running on it, then you should use a different port than port 80 for your Web server. Technical routesI develop my code in two stages. In the first stage, I simply implement the server program to receive the HTTP request messages and display the contents. After this is running properly, I add the code to generate appropriate responses in the second stage. The Web server have a log file to record statistics of the client requests. Each request corresponds to one line of record in the log. Write down client hostname/IP address, access time, requested file name and response type for each record. My Web server also can handle some simple errors, such as web-page not found. NoteI use Python languages for the project. When implementing the Web server, I use basic socket programming classes to build the Web server from scratch instead of using the HTTPServer class directly. main menu codeclient_connection.setsockopt(socket.SOL_SOCKET, socket.SO_KEEPALIVE, True) client_connection.ioctl(socket.SIO_KEEPALIVE_VALS,(1, 60*1000, 30*1000)) code of main menu&lt;html&gt; &lt;head&gt; &lt;link rel=&quot;icon&quot; href=&quot;data:,&quot;&gt; &lt;title&gt;Index&lt;/title&gt; &lt;link rel=&quot;icon&quot; href=&quot;data:,&quot;&gt; &lt;/head&gt; &lt;body&gt; &lt;h3&gt;Welcome to the Multi-thread Web Server.&lt;/h3&gt; &lt;p&gt;Here's a link to &lt;a href=&quot;helloworld.html&quot;&gt;alice.txt&lt;/a&gt;.&lt;/p&gt; &lt;p&gt;Here's a link to &lt;a href=&quot;image.html&quot;&gt;image.jpg&lt;/a&gt;.&lt;/p&gt; &lt;p&gt;Here's a link to &lt;a href=&quot;404.html&quot;&gt;404&lt;/a&gt;.&lt;/p&gt; &lt;p&gt;Here's a link to &lt;a href=&quot;textlog.txt&quot;&gt;textlog.txt&lt;/a&gt;.&lt;/p&gt; &lt;/body&gt; &lt;/html&gt; return 200 or 304 else: if dt1 &lt; ifmodified and first is not True: response = 'HTTP/1.1 304 Not Modified\\nLast_Modified: {0}\\n'.format(modify_time) client_connection.sendall(response.encode()) # return 304 because the file not modified else: ifmodified = datetime.now() response = 'HTTP/1.1 200 OK\\nLast_Modified: {0}\\n'.format(modify_time) #command finish successfully first1 = True client_connection.sendall(response.encode()) fin = open('htdocs' + filename) content = fin.read() fin.close() response = 'If-Modified-Since: '+now_time+'\\n\\n'+content client_connection.sendall(response.encode()) # This implements the GET command txt file function of this program After running the program, enter the http://127.0.0.1:8000 in the browser, at this time the browser will send a GET command like a web server running in the background, and the run function in the program starts a subprocess to call the handle_request function after receiving the command, where the user’s request is further processed. For example, this time we send the GET command to determine the last modified date and if-modified-since date of the file after the if statement determines that we want to open a file that is not an image file and decides the return value, because we are the first time to access this server , and the file we access exists on the server, we get a return value of 200 ok, which allows us to display the returned file normally.","link":"/2023/01/05/webSever/"}],"tags":[{"name":"Photography","slug":"Photography","link":"/tags/Photography/"},{"name":"Travel","slug":"Travel","link":"/tags/Travel/"},{"name":"Cheung Chau","slug":"Cheung-Chau","link":"/tags/Cheung-Chau/"},{"name":"Confucius Institute","slug":"Confucius-Institute","link":"/tags/Confucius-Institute/"},{"name":"Volunteer","slug":"Volunteer","link":"/tags/Volunteer/"},{"name":"Campus Experience","slug":"Campus-Experience","link":"/tags/Campus-Experience/"},{"name":"Students Assistants","slug":"Students-Assistants","link":"/tags/Students-Assistants/"},{"name":"TALE 2022","slug":"TALE-2022","link":"/tags/TALE-2022/"},{"name":"Pedagogy","slug":"Pedagogy","link":"/tags/Pedagogy/"},{"name":"Educational technology","slug":"Educational-technology","link":"/tags/Educational-technology/"},{"name":"Tai Mo Shan","slug":"Tai-Mo-Shan","link":"/tags/Tai-Mo-Shan/"},{"name":"PolyU","slug":"PolyU","link":"/tags/PolyU/"},{"name":"Department of Computing","slug":"Department-of-Computing","link":"/tags/Department-of-Computing/"},{"name":"PolyU CSSA","slug":"PolyU-CSSA","link":"/tags/PolyU-CSSA/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"Multi-thread","slug":"Multi-thread","link":"/tags/Multi-thread/"},{"name":"Web server","slug":"Web-server","link":"/tags/Web-server/"},{"name":"Wireshark","slug":"Wireshark","link":"/tags/Wireshark/"},{"name":"Project","slug":"Project","link":"/tags/Project/"}],"categories":[{"name":"Photography","slug":"Photography","link":"/categories/Photography/"},{"name":"Volunteer Experience","slug":"Volunteer-Experience","link":"/categories/Volunteer-Experience/"},{"name":"Employment Record","slug":"Employment-Record","link":"/categories/Employment-Record/"},{"name":"Project","slug":"Project","link":"/categories/Project/"}],"pages":[{"title":"About Me","text":"EDUCATIONThe Hong Kong Polytechnic University (PolyU)-Hong Kong, China BSc (HONS) COMPUTING 2022-present C/C++, Java, Python, R, Assembly-language, Discrete mathematics, Compilers Principles, Computer network, Data structures, Computer organization, Database systems, Introduction to data analytics, OOP EXCHANGE EXPERIENCEHarbin Institute of Technology Project 2: Leading Computer Science, Creating the Future 2021/22 Semester 3 Graphical Models and Probabilistic Inference Fudan University 復旦大學港澳萬人計畫秋季課程 2022 2022/23 Semester 1 Introduction to Python","link":"/about/index.html"},{"title":"categories","text":"","link":"/categories/index.html"}]}