{"posts":[{"title":"Cheung Chau","text":"Cheung Chau Personal Photography Collection Fisherman Birds and fish Road White House Oil painting Tree shade Tyndall Toys RELEAX Sacred Island Clock ringing Refuge Waves Tofu Tricolour Memories Hot Dinner","link":"/2023/01/04/Cheung-Chau/"},{"title":"Kongzi","text":"","link":"/2023/01/05/Kongzi/"},{"title":"Assisted in organising TALE 2022 during as a student assistant in the Department of Computing","text":"IEEE International Conference on Teaching, Assessment, and Learning for Engineering (TALE) 2022 Transforming Educational Technologies and Pedagogies for the Next Decade About TALEIEEE TALE is the IEEE Education Society’s flagship Asia-Pacific conference series, catering to researchers and practitioners with an interest in engineering, technology, and integrated STEM education as well as those interested in the innovative use of digital technologies for learning, teaching, and assessment in any discipline. The conference target audience is diverse and includes those working in the higher education, vocational education and training (VET), K-12, corporate, government, and healthcare sectors. ThemeTransforming Educational Technologies and Pedagogies for the Next Decade Core Tracks● Engineering Education ● Computing &amp; IT Education ● STEM Education ● Technology-Enhanced Learning ● Open, Flexible &amp; Distance Learning ● Workplace &amp; Industry-Based Learning AcknowledgementIEEE TALE 2022 is supported by a grant of the Croucher Foundation","link":"/2023/01/05/TALE/"},{"title":"Tai Mo Shan","text":"Tai Mo Shan Personal Photography Collection Road Human Ink Miao Gao Wind City Orange afternoon World Cup M148 Downhill Winter Tiredness Home","link":"/2023/01/04/Tai-Mo-Shan/"},{"title":"Volunteers for the PolyU 85th Anniversary Public Lecture Series","text":"To celebrate its 85th anniversary, PolyU organised a public lecture at the Jockey Club Auditorium PolyU inviting Ms Guo Jingjing, an Olympic gold medalist, to share her experience as an athlete and Olympic gold medalist with the theme of “Pouring Water into Light - Chasing Your Dreams” to encourage young people to persevere in pursuing their dreams. The talk attracted over 800 guests, students, teachers, alumni and members of the public. My dutyI am honoured to have been given the opportunity by the PolyU to participate in this event and my task is to Audiorium","link":"/2023/01/05/guojingjing/"},{"title":"infoDay","text":"","link":"/2023/01/05/infoDay/"},{"title":"Volunteer Umpire in 2022 Poly CSSA Table Tennis Competition","text":"The event is organised by PolyU CSSA and the venue and prize costs are also covered by CSSA My dutyMy task is to supervise the game, calculate the scores for the game and announce the winner","link":"/2023/01/05/pingpang/"},{"title":"Multi-thread Web Server","text":"This project aims to develop a socket program to implement a Web service using the HTTP protocol. Function create a connection socket when contacted by a client (browser); receive the HTTP request from this connection; parse the request to determine the specific file being requested; get the requested file from the server’s file system; create an HTTP response message consisting of the requested file preceded by header lines; send the response over the TCP connection to the requesting client. If the client requests a file that is not present in the server, the server will return a “404 Not Found” error message. NoteYour can run server program, and then test server program by sending requests from the client programs running on different hosts. You may run the server on your own computer, using the IP address of 127.0.0.1. If you run server on a host that already has a Web server running on it, then you should use a different port than port 80 for your Web server. Technical routesI develop my code in two stages. In the first stage, I simply implement the server program to receive the HTTP request messages and display the contents. After this is running properly, I add the code to generate appropriate responses in the second stage. The Web server have a log file to record statistics of the client requests. Each request corresponds to one line of record in the log. Write down client hostname/IP address, access time, requested file name and response type for each record. My Web server also can handle some simple errors, such as web-page not found. NoteI use Python languages for the project. When implementing the Web server, I use basic socket programming classes to build the Web server from scratch instead of using the HTTPServer class directly.","link":"/2023/01/05/webSever/"}],"tags":[{"name":"Photography","slug":"Photography","link":"/tags/Photography/"},{"name":"Travel","slug":"Travel","link":"/tags/Travel/"},{"name":"Cheung Chau","slug":"Cheung-Chau","link":"/tags/Cheung-Chau/"},{"name":"Students Assistants","slug":"Students-Assistants","link":"/tags/Students-Assistants/"},{"name":"TALE 2022","slug":"TALE-2022","link":"/tags/TALE-2022/"},{"name":"Pedagogy","slug":"Pedagogy","link":"/tags/Pedagogy/"},{"name":"Educational technology","slug":"Educational-technology","link":"/tags/Educational-technology/"},{"name":"Tai Mo Shan","slug":"Tai-Mo-Shan","link":"/tags/Tai-Mo-Shan/"},{"name":"PolyU","slug":"PolyU","link":"/tags/PolyU/"},{"name":"Volunteer","slug":"Volunteer","link":"/tags/Volunteer/"},{"name":"Campus Experience","slug":"Campus-Experience","link":"/tags/Campus-Experience/"},{"name":"PolyU CSSA","slug":"PolyU-CSSA","link":"/tags/PolyU-CSSA/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"Multi-thread","slug":"Multi-thread","link":"/tags/Multi-thread/"},{"name":"Web server","slug":"Web-server","link":"/tags/Web-server/"},{"name":"Wireshark","slug":"Wireshark","link":"/tags/Wireshark/"},{"name":"Project","slug":"Project","link":"/tags/Project/"}],"categories":[{"name":"Photography","slug":"Photography","link":"/categories/Photography/"},{"name":"Employment record","slug":"Employment-record","link":"/categories/Employment-record/"},{"name":"Volunteer Experience","slug":"Volunteer-Experience","link":"/categories/Volunteer-Experience/"},{"name":"Project","slug":"Project","link":"/categories/Project/"}],"pages":[{"title":"About Me","text":"EDUCATIONThe Hong Kong Polytechnic University (PolyU)-Hong Kong, China BSc (HONS) COMPUTING 2022-present C/C++, Java, Python, R, Assembly-language, Discrete mathematics, Compilers Principles, Computer network, Data structures, Computer organization, Database systems, Introduction to data analytics, OOP EXCHANGE EXPERIENCEHarbin Institute of Technology Project 2: Leading Computer Science, Creating the Future 2021/22 Semester 3 Graphical Models and Probabilistic Inference Fudan University 復旦大學港澳萬人計畫秋季課程 2022 2022/23 Semester 1 Introduction to Python","link":"/about/index.html"},{"title":"categories","text":"","link":"/categories/index.html"}]}